{
    "message": "Context received successfully",
    "BDD": "**Scenario 1: Successful Login**\n* **Given** a user with valid credentials\n* **When** the user enters their credentials and clicks \"Login\"\n* **Then** the user is successfully logged in\n\n**Scenario 2: Unsuccessful Login - Invalid Credentials**\n* **Given** a user with invalid credentials\n* **When** the user enters their credentials and clicks \"Login\"\n* **Then** an error message is displayed, indicating invalid credentials\n\n**Scenario 3: Unsuccessful Login - Empty Credentials**\n* **Given** a user provides empty credentials\n* **When** the user clicks \"Login\"\n* **Then** an error message is displayed, indicating that credentials are required\n\n\n**Scenario 4: Successful Task Creation**\n* **Given** a logged-in user\n* **When** the user enters task details and clicks \"Create Task\"\n* **Then** the task is created and displayed in the task list\n\n**Scenario 5: Unsuccessful Task Creation - Missing Details**\n* **Given** a logged-in user\n* **When** the user clicks \"Create Task\" without entering any task details\n* **Then** an error message is displayed, indicating that task details are required\n\n**Scenario 6: Successful Task Deletion**\n* **Given** a logged-in user with an existing task\n* **When** the user selects a task and clicks \"Delete Task\"\n* **Then** the task is deleted and removed from the task list\n\n**Scenario 7: Unsuccessful Task Deletion - No Task Selected**\n* **Given** a logged-in user with existing tasks\n* **When** the user clicks \"Delete Task\" without selecting a task\n* **Then** an error message is displayed, indicating that a task must be selected for deletion\n\n**Scenario 8: Deleting the last remaining task**\n* **Given** a logged-in user with only one remaining task\n* **When** the user deletes the task\n* **Then** the task list should be empty, and potentially display a message indicating no tasks are present.\n\n**Scenario 9: Creating a task with maximum allowed characters**\n* **Given** a logged in user enters task details with the maximum allowed character limit (assuming there is a limit)\n* **When** the user clicks \"Create Task\"\n* **Then** the task is successfully created.\n\n**Scenario 10: Creating a task exceeding maximum character limit**\n* **Given** a logged in user enters task details exceeding the maximum character limit (assuming there is a limit)\n* **When** the user clicks \"Create Task\"\n* **Then** an error message is displayed, indicating the character limit has been exceeded.\n\n\nThese test cases cover the basic functionalities, positive and negative paths, as well as edge cases related to empty inputs and boundary conditions,  without including UI or stress testing scenarios, as requested.\n"
}